


Love = 'взаимопонимание, уважение, доверие, забота, привязанность, счастье, радость,эмоции,спокойствие, верность'
Religion = 'ислам, чистота, духовное состояние, благодарность, терпение, покорность, милосердие, уважение, нравственность'
Space = 'воздух, звезды, легкость, вселенная, галактика, планеты, гагарин, бесконечность, спутник'
Vehicle = 'Toyota Camry 70, кожанный, коричневый интерьер, белый цвет, скорость, комфорт, безопасность, продвинутые технологии, левый руль'
Nature = 'водопад, зеленые деревья, речки, пение птичек, пейзаж, пикник, отдых, воздух, свобода'

print ('Любовь:', Love, '\n', 'Религия:', Religion, '\n', 'Космос:', Space, '\n', 'Автомобили:', Vehicle, '\n', 'Природа:', Nature)
