
Тип = 'ноутбук'
Операционнаясистема = 'macOS'

 
Процессор = 'Apple M1'
Количествоядерпроцессора = 8
Чипсет = 'Apple SoC'

Память = '8 ГБ'

Экран = '13.3 дюймов, 2560x1600, широкоформатный'
Типматрицыэкрана = 'IPS'
Подсветкаэкрана = 'светодиодная'
Типвидеокарты =  'встроенная'
Видеопроцессор = 'Apple graphics 7-core'
Типвидеопамяти = 'SMA'


Конфигурациянакопителей = 'SSD'
Общийобъемнакопителей = '256 ГБ'
Общийобъемнакопителей = 'SSD 256 ГБ'
Оптическийпривод = 'нет'


Беспроводнаясвязь = 'Wi-Fi IEEE 802.11ax'
Bluetooth = '5.0'
Фунционал = 'USB Type-C Thunderbolt 4'


Времяработыотаккумулятора = '18 ч'
Емкостьаккумулятора = '49.9 Вт⋅ч'
Типаккумулятора = 'Li-Pol'


Устройствапозиционирования =  'Touchpad'
Количествоклавишклавиатуры = 79
Подсветкаклавиатуры = 'есть'


Встроенныеколонки = 'есть'
Встроенныймикрофон = 'есть'


Вебкамера = '1 МП'
Сканеротпечаткапальца =  'есть'
Особенности = ' металлическийкорпус, пассивное охлаждение'
Комплектацияадаптерпитания = 'USB-C, шнур питания (2 м)'
Размеры  = '304.1x212.4x16.1 мм'
Вес = '1.29 кг'





print ('Тип:', Тип)
print ('Операционная система:', Операционнаясистема)
print ('Процессор:', Процессор)
print ('Количество ядер процессора:', Количествоядерпроцессора)
print ('Чипсет:', Чипсет)
print ('Память:', Память)
print ('Экран:', Экран)
print ('Тип матрицы экрана:', Типматрицыэкрана)
print ('Подсветка экрана:', Подсветкаэкрана)
print ('Тип видеокарты:', Типвидеокарты)
print ('Видеопроцессор:', Видеопроцессор)
print ('Тип видеопамяти:', Типвидеопамяти)
print ('Конфигурация накопителей:', Конфигурациянакопителей)
print ('Общий объем накопителей:', Общийобъемнакопителей)
print ('Общий объем накопителей:', Общийобъемнакопителей)
print ('Оптический привод:', Оптическийпривод)
print ('Беспроводная связь:', Беспроводнаясвязь)
print ('Bluetooth:', Bluetooth)
print ('Фунционал:', Фунционал)
print ('Время работы от аккумулятора:', Времяработыотаккумулятора)
print ('Емкость аккумулятора:', Емкостьаккумулятора)
print ('Тип аккумулятора:', Типаккумулятора)
print ('Устройства позиционирования:', Устройствапозиционирования)
print ('Количество клавиш клавиатуры:', Количествоклавишклавиатуры)
print ('Подсветка клавиатуры:', Подсветкаклавиатуры)
print ('Встроенные колонки:', Встроенныеколонки)
print ('Встроенный микрофон:', Встроенныймикрофон)
print ('Веб-камера:', Вебкамера)
print ('Сканер отпечатка пальца:', Сканеротпечаткапальца)
print ('Особенности:', Особенности)
print ('Комплектация адаптер питания:', Комплектацияадаптерпитания)
print ('Размеры (ДхШхТ):', Размеры)
print ('Вес:', Вес)
